import backgroundImage from "../../../assets/school_history.jpg";
import Logo from "../../../assets/logo.png";
import Por from "../../../assets/po.jpg";

const SchoolHistory = () => {
    return (
        <div>
            <div
                className="relative w-full h-[500px] bg-cover bg-center"
                style={{ backgroundImage: `url(${backgroundImage})` }}
            >
                <div className="absolute inset-0 bg-black opacity-50"></div>
                <div className="relative flex items-center justify-center h-full">
                    <h1 className="text-white text-4xl md:text-6xl font-bold">
                        ประวัติโรงเรียนคลองขามวิทยาคาร
                    </h1>
                </div>
            </div>

            <div className="bg-gray-100 py-12">
                <div className="container mx-auto px-4">
                    <div className="flex flex-wrap -mx-4">
                        {/* Left Column: School History */}
                        <div className="w-full md:w-2/3 px-4 mb-8 md:mb-0">
                            <div className="bg-white p-6 rounded-md shadow-md">
                                <h2 className="text-xl font-bold mb-4">ประวัติโรงเรียน</h2>
                                <p className="text-gray-700 leading-relaxed mb-4">
                                    วิทยาลัยอาชีวศึกษาอุดรธานี  ได้ก่อตั้งขึ้นเมื่อวันที่ 7 กรกฎาคม 2481  ณ บริเวณบ้านพักอุปราชและสมุหเทศาภิบาลสำเร็จราชการมณฑลอุดร เดิมชื่อ โรงเรียนช่างทอผ้าอุดรธานี
                                    พ.ศ. 2483 เปิดสอนแผนกช่างตัดเย็บเสื้อผ้าในโรงเรียนช่างทอผ้าอุดรธานี
                                    พ.ศ. 2491 ยุบแผนกช่างทอผ้าไปรวมกับแผนกตัดเย็บเสื้อผ้า ตั้งเป็นแผนกการช่างสตรีชั้นต้น และ    ได้เปลี่ยนชื่อเป็น โรงเรียนการช่างสตรีอุดรธานี
                                    พ.ศ. 2493 ได้รับอนุมัติจากกระทรวงศึกษาธิการให้เปิดสอนในระดับอาชีวศึกษาชั้นปลายเพิ่มเติมจาก ระดับอาชีวศึกษาชั้นต้นและรับนักเรียนระดับมัธยมศึกษาปีที่ 3 เข้าศึกษาต่อ
                                    พ.ศ. 2507 โรงเรียนการช่างสตรีอุดรธานีได้รับการคัดเลือกให้เข้าอยู่ในโครงการปรับปรุง สถานศึกษาขององค์การยูนิเซฟ ได้ทำการสอนถึงระดับมัธยมศึกษาตอนปลายสายอาชีพ
                                    พ.ศ. 2513 ยุบแผนกวิชาศิลปหัตถกรรมเปิดสอนแต่แผนกวิชาผ้าและการตัดเย็บแผนกวิชาอาหารและโภชนาการ แผนกวิชาคหกรรมศาสตร์
                                    พ.ศ. 2515 เปิดสอนหลักสูตรมัธยมศึกษาตอนปลายสายอาชีพ แผนกพณิชยการพร้อมเปลี่ยนชื่อจาก โรงเรียนการช่างสตรีอุดรธานี  เป็น โรงเรียนอาชีวศึกษาอุดรธาน
                                    พ.ศ. 2519 โรงเรียนอาชีวศึกษาอุดรธานี ร่วมกับโรงเรียนเทคนิคอุดรธานีและจัดตั้งเป็นวิทยาลัย อาชีวศึกษาอุดรธานี เมื่อ 1 ต.ค. 2519 พร้อมกับแบ่งหน่วยงานเป็น 2 วิทยาเขตคือวิทยาเขตเทคนิคอุดรธานี และวิทยาเขตอาชีวศึกษาอุดรธานี เปิดสอนระดับประโยควิชาชีพชั้นสูง (ปวส.) สาขาวิชาคหกรรม  สาขาผ้าและการตัดเย็บในปีเดียวกัน
                                    พ.ศ. 2522 กระทรวงศึกษาธิการได้ประกาศแยกวิทยาเขตทั้ง 2 แห่งออกจากกันจัดตั้งเป็นวิทยาลัยอาชีวศึกษาอุดรธานี และได้ขยายการศึกษาระดับประโยควิชาชีพชั้นสูง (ปวส.) คณะวิชาบริหารธุรกิจ สาขาวิชาการตลาด
                                    พ.ศ. 2524  โดยประกาศใช้หลักสูตรประกาศนียบัตรวิชาชีพ (ปวช.) ปี พ.ศ. 2524 แทนหลักสูตรการเรียนการสอนในปี พ.ศ.2518 และกระทรวงศึกษาธิการได้ประกาศใช้หลักสูตรประกาศนียบัตรวิชาชีพเทคนิค (ปวท.) คณะวิชาบริหารธุรกิจ สาขาวิชาการบัญชี
                                    พ.ศ. 2525 ได้เปิดสอนหลักสูตรวิชาชีพเทคนิค (ปวท.) สาขาวิชาธุรกิจการเงิน การธนาคาร
                                    พ.ศ. 2527 เปิดสอนระดับประกาศนียบัตรวิชาชีพชั้นสูง (ปวส.) สาขาวิชาการบัญชีและสาขาวิชาอาหารและโภชนาการ
                                    พ.ศ. 2528 ได้รับเลือกให้เป็นสถานศึกษาเร่งรัดพัฒนาดีเด่นของกลุ่มสถานศึกษาสังกัดกรมอาชีวศึกษาในภาคตะวันออกเฉียงเหนือ
                                    พ.ศ.2529 ได้รับคัดเลือกให้เป็นสถานศึกษาดีเด่นประเภทวิชาคหกรรม พาณิชยกรรมและศิลปหัตถกรรม ของกรมอาชีวศึกษา
                                    พ.ศ. 2530 เปิดสอนระดับ ปวส.  สาขาวิชาคอมพิวเตอร์ธุรกิจ
                                    พ.ศ. 2532 เปิดสอนระดับ ปวท.  สาขาวิชาคอมพิวเตอร์ธุรกิจ
                                    พ.ศ. 2536 เปิดสอนระดับ ปวช.  สาขาวิชาคหกรรมธุรกิจี
                                </p>
                            </div>
                        </div>

                        <div className="w-full md:w-1/3 px-4">
                            <div className="bg-white p-6 mb-5 rounded-md shadow-md">
                                <div className="flex items-center justify-center mb-6">
                                    <img
                                        src={Logo}
                                        alt="ตราโรงเรียน"
                                        className="h-35"
                                    />
                                </div>
                                <h3 className="text-lg font-bold mb-4 text-center">ตราโรงเรียน</h3>
                                <ul className="text-gray-700">
                                    <li className="mb-2">
                                        <strong>วันก่อตั้ง:</strong> 7 กรกฎาคม พ.ศ. 2481
                                    </li>
                                    <li className="mb-2">
                                        <strong>ที่ตั้ง:</strong> เลขที่ 8 ซอยแก้วเพชร ...
                                    </li>
                                    <li className="mb-2">
                                        <strong>โทรศัพท์:</strong> 0-4224-6690
                                    </li>
                                </ul>
                            </div>
                            <div className="bg-white p-6 rounded-md shadow-md">
                            <h3 className="text-lg font-bold mb-4 text-center">ผู้อำนวยการโรงเรียน</h3>
                                <div className="flex items-center justify-center mb-6">
                                    <img
                                        src={Por}
                                        alt="ผู้อำนวยการโรงเรียน"
                                        className="h-30"
                                    />
                                </div>
                                <ul className="text-gray-700">
                                    <li className="mb-2">
                                        <strong>นายประจวบ อินทรโชติ</strong>
                                    </li>
                                    <li className="mb-2">
                                        <strong>ผู้อำนวยการโรงเรียนสามเสนวิทยาลัย</strong>
                                    </li>
                                </ul>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    );
};

export default SchoolHistory;
